app/views/jobapps/_stats.html.erb

	<strong>
		<%= @jobapp.users.count %>
---
SELECT COUNT(*) FROM "users" INNER JOIN "relationships" ON "users"."id" = "relationships"."user_id" WHERE "relationships"."jobapp_id" = ?  [["jobapp_id", 10]]