app/views/jobapps/index.html.erb

SELECT COUNT(*) FROM "users" INNER JOIN "relationships" ON "users"."id" = "relationships"."user_id" WHERE "relationships"."jobapp_id" = ?  [["jobapp_id", 1]]
---

						<%= jobapp.users.count %>