app/controllers/datadictionarylist_controller.rb

SELECT "data_dictionaries".* FROM "data_dictionaries"  WHERE (id < '900')  ORDER BY id asc
---
  def index
    @data_dictionaries = DataDictionary.where( "id < ?", "900").order("id asc")