app/controllers/data_dictionaries_controller.rb

  def index
    @dict_id = params[:dictid]
    set_parent_id(params[:dictid])
    @dict_name = params[:dictname]
    @data_dictionaries = DataDictionary.where( "id > ? AND parent_code = ? AND del_flg = ?", "999", get_parent_id, 0)
---
SELECT  "data_dictionaries".* FROM "data_dictionaries"  WHERE (id > '999' AND parent_code = '1')  ORDER BY id desc LIMIT 1