app/controllers/jobapps_controller.rb

SELECT "jobapps".* FROM "jobapps"
---
  def index
    @jobapps = Jobapp.all

SELECT  "jobapps".* FROM "jobapps"  WHERE "jobapps"."id" = ? LIMIT 1  [["id", 10]]
---
  def show
    @jobapp = Jobapp.find(params[:id])

INSERT INTO "jobapps" ("created_at", "dept", "description", "num", "requirement", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @jobapp = Jobapp.new(jobapp_params)

      if @jobapp.save

DELETE FROM "jobapps" WHERE "jobapps"."id" = ?  [["id", 10]]
---
  def destroy
    @jobapp.destroy

SELECT  "jobapps".* FROM "jobapps"  WHERE "jobapps"."id" = ? LIMIT 1  [["id", 10]]
---
    def set_jobapp
      @jobapp = Jobapp.find(params[:id])